#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_appsync_graphql_api.example: Refreshing state... [id=qc5idigsbbhhlg4ugyupm5wv4u]
aws_cognito_user_pool.bottel-user-pool: Refreshing state... [id=us-east-1_Qw7pOPfDK]
aws_s3_bucket.cdn_bucket: Refreshing state... [id=bottel-cdn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_appsync_graphql_api.example has changed
  ~ resource "aws_appsync_graphql_api" "example" {
        id                  = "qc5idigsbbhhlg4ugyupm5wv4u"
        name                = "bottel-api"
      + tags                = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cognito_user_pool.bottel-user-pool has changed
  ~ resource "aws_cognito_user_pool" "bottel-user-pool" {
      + auto_verified_attributes  = []
        id                        = "us-east-1_Qw7pOPfDK"
        name                      = "bottel-user-pool"
      + tags                      = {}
        # (7 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_appsync_datasource.example will be created
  + resource "aws_appsync_datasource" "example" {
      + api_id = (known after apply)
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "bottles-datasource"
      + type   = "AMAZON_DYNAMODB"

      + dynamodb_config {
          + region     = (known after apply)
          + table_name = "Bottles"
        }
    }

  # aws_appsync_graphql_api.bottel-api will be created
  + resource "aws_appsync_graphql_api" "bottel-api" {
      + arn                 = (known after apply)
      + authentication_type = "AMAZON_COGNITO_USER_POOLS"
      + id                  = (known after apply)
      + name                = "bottel-api"
      + tags_all            = (known after apply)
      + uris                = (known after apply)

      + user_pool_config {
          + aws_region     = "us-east-1"
          + default_action = "DENY"
          + user_pool_id   = "us-east-1_Qw7pOPfDK"
        }
    }

  # aws_appsync_graphql_api.example will be destroyed
  # (because aws_appsync_graphql_api.example is not in configuration)
  - resource "aws_appsync_graphql_api" "example" {
      - arn                 = "arn:aws:appsync:us-east-1:062130427086:apis/qc5idigsbbhhlg4ugyupm5wv4u" -> null
      - authentication_type = "AMAZON_COGNITO_USER_POOLS" -> null
      - id                  = "qc5idigsbbhhlg4ugyupm5wv4u" -> null
      - name                = "bottel-api" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
      - uris                = {
          - "GRAPHQL"  = "https://h5rfvzzc45eqhmq3q7dgx4cnki.appsync-api.us-east-1.amazonaws.com/graphql"
          - "REALTIME" = "wss://h5rfvzzc45eqhmq3q7dgx4cnki.appsync-realtime-api.us-east-1.amazonaws.com/graphql"
        } -> null
      - xray_enabled        = false -> null

      - user_pool_config {
          - aws_region     = "us-east-1" -> null
          - default_action = "DENY" -> null
          - user_pool_id   = "us-east-1_Qw7pOPfDK" -> null
        }
    }

  # aws_dynamodb_table.bottles-table will be created
  + resource "aws_dynamodb_table" "bottles-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "Bottles"
      + range_key        = "name"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 20

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "name"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>